In [1]:
#Lecture 24

In [2]:
#open souce built on numpy
#fast analysis - data cleaning and prep (like r)
#performance and productivity
#built in visualisation features
#can work with data from a wide variety of sources

In [91]:
###
#Series
#DataFrames
#Missing data
#groupby
#merging, joining and concatenation 
#operations
#data input and output

In [92]:
#lecture 25 Series

In [93]:
import numpy as np
import pandas as pd

In [94]:
labels = ["a", "b", "c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"a":10,"b":20,"c":30}

In [95]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [96]:
pd.Series(data=my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [97]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [98]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [99]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [100]:
d

{'a': 10, 'b': 20, 'c': 30}

In [101]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [102]:
pd.Series(data=[sum,print,len]) ##this is just to demonstrate the flexibiity of pandas

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [103]:
ser1 = pd.Series([1,2,3,4],["USA", "Germany", "USSR", "Japan" ])

In [104]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [105]:
ser2 = pd.Series([1,2,5,4],["USA", "Germany", "Italy", "Japan"])

In [106]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [107]:
ser1["USA"]

1

In [108]:
ser3 = pd.Series(data=labels)

In [109]:
ser3

0    a
1    b
2    c
dtype: object

In [110]:
ser3[0]

'a'

In [111]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [112]:
ser1+ser2 #pandas will always convert numbers to a float
###it can only add them up if there are matching indexes in both lists

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [113]:
####lecture 26 - Data Frames

##this is the main tool when working with pandas

In [114]:
from numpy.random import randn

In [115]:
np.random.seed(101)

In [116]:
df = pd.DataFrame(randn(5,4),["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])

In [117]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [118]:
###getting object from DF
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [119]:
type(df["W"]) ##converts this to a series

pandas.core.series.Series

In [120]:
type(df) ###dataframe is a bunch of series that share the same index

pandas.core.frame.DataFrame

In [121]:
###you can use the dot notation. not recommended. use brackets
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [122]:
df[["W","Z"]] ## you can get the dataframe of multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [123]:
type(df[["W","Z"]])

pandas.core.frame.DataFrame

In [124]:
df["new"] = df["W"] + df["Y"] #adds a column
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [125]:
df.drop("new", axis=1,inplace = True) ###deletes out column

In [126]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [127]:
df.drop("E", axis=0) ###you need to add inplace to true to permanently delete out

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [128]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
df.shape ##in relation to the axis...it goes back to hows its structures rows then columns
##i.e. rows = 0 axis, columns = 1 axis

(5, 4)

In [130]:
 df[["Z","X"]] ###selecting multiple columsn

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [132]:
####selecting rows with index name
df.loc["A"] ###this returns a series

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [135]:
####selecting rows with index location 
df.iloc[2]  ##iloc stands for index based location

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [136]:
###They both just return series

In [137]:
df.loc["B","Y"] ## gets the item at row B and column Y

-0.84807698340363147

In [138]:
#continue at 13mins

In [141]:
df.loc[["A", "B"], ["W", "Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [142]:
###lecture 27
###DataFrames Part 2

In [143]:
###conditional selection using bracket notation

In [144]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [145]:
df < 0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [146]:
booldf = df > 0

In [147]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [148]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [149]:
###continue at 2mins

In [150]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [152]:
df["W"]>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [153]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [155]:
df[df["W"]>0]  #removes the null value in column W

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [156]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [159]:
###2 step process of getting column X from new dataframe 
resultdf = df[df["W"]>0] 
resultdf["X"]

In [161]:
#1 step process to get the column
df[df["W"]>0] ["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [163]:
df[df["W"]>0] [["X", "Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [169]:
boolser = df["W"]>0
result = df[boolser]
mycols = ["Y", "X"]
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [168]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [170]:
###simple one line is better

In [171]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [173]:
df[(df["W"]>0) & (df["Y"]>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [175]:
#cant use the and operator have to use the & with series
##use pipe | instead of or

In [177]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [179]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [180]:
newind = "CA NY WY OR CO".split()

In [181]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [182]:
df["States"] = newind

In [183]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [184]:
df.set_index("States")

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [185]:
#recap
#conditional selection
#multiple conditional selection with & |
#Reset index and set a index.
#nplace = True if you want it to be permanent

In [186]:
###lecture 28 
#DF part 3 
#multi index and hierachy

In [191]:
#Index levels 
outside = "G1 G1 G1 G2 G2 G2".split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [193]:
df = pd.DataFrame(randn(6,2),hier_index, ["A", "B"])

In [194]:
df  ###multiple levels of index

             A         B
G1 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366
G2 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259

In [197]:
df.loc["G1"]

          A         B
1  0.238127  1.996652
2 -0.993263  0.196800
3 -1.136645  0.000366

In [198]:
df.loc["G1"].loc[1]

A    0.238127
B    1.996652
Name: 1, dtype: float64

In [199]:
df.index.names

FrozenList([None, None])

In [210]:
df.index.names = ["Groups", "Num"]

In [211]:
 df

                   A         B
Groups Num
G1     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366
G2     1    1.025984 -0.156598
       2   -0.031579  0.649826
       3    2.154846 -0.610259

In [212]:
df.loc["G2"].loc[2]["B"]

0.64982583349084544

In [213]:
df.xs("G1") #xs means cross section 
#df.loc["G1"] ##not a lot of difference between the 2

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [214]:
##get theindex 1 of both G1 and G2
df.xs(1, level="Num")

               A         B
Groups
G1      0.238127  1.996652
G2      1.025984 -0.156598

In [215]:
###lecture 29 missing data

In [216]:
###how to deal with missing data in Pandas

In [219]:
d = {"A":[1,2,np.nan],"B":[5, np.nan, np.nan],"C":[1,2,3]}

In [220]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [221]:
df = pd.DataFrame(d)

In [222]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [225]:
df.dropna() ##you an do this for rows and columns

     A    B  C
0  1.0  5.0  1

In [226]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [231]:
df.dropna(thresh=2) #gets rid of items with 2 or more nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [232]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [234]:
####fill in the missing values 
df.fillna(value = "Yes")

     A    B  C
0    1    5  1
1    2  Yes  2
2  Yes  Yes  3

In [237]:
df["A"].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [239]:
##Lecture 30 

##groupby method 

##group rows together and call the aggregate function

In [240]:
###similar to sql 

###allows you to group rows together based off a column and perform aggregate function on them

In [ ]:
##aggregate functions include sum, standard deviation 

#start at 1min 30